src/Catalogs/Scan_ОпцииПродуктов/Scan_ОпцииПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ОпцииПродуктов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БазовыеОпции</name>
      <description>Базовые</description>
    </items>
    <items>
      <name>SOrderОпции</name>
      <description>S-order</description>
    </items>
    <items>
      <name>FFUОпции</name>
      <description>FFU</description>
    </items>
    <items>
      <name>ЛокальныеОпции</name>
      <description>Локальные опции</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВСпецификации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяНаРынкеРФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяОпция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОпции</name>
    <type>
      <types>CatalogRef.Scan_ТипыОпций</types>
    </type>
  </attributes>
  <attributes>
    <name>RefCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникRefCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукта</name>
    <type>
      <types>CatalogRef.Scan_ВидыПродуктов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_ТипыОпций/Scan_ТипыОпций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ТипыОпций</name>
  <predefined>
    <items>
      <name>FFUОпции</name>
      <description>FFU</description>
    </items>
    <items>
      <name>SOrderОпции</name>
      <description>S-order</description>
    </items>
    <items>
      <name>БазовыеОпции</name>
      <description>Базовые</description>
    </items>
    <items>
      <name>ЛокальныеОпции</name>
      <description>Локальные</description>
    </items>
    <items>
      <name>ОпцииНадстроек</name>
      <description>Опции надстройки</description>
    </items>
    <items>
      <name>ОпцииОборудования</name>
      <description>Опции оборудования</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_ОпцииПродуктов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //rarus bonmak 08.10.2019 14177 ++
	//rarus bonmak 05.12.2019 14177 закомментировал ++
	//Если Объект.Ссылка.Пустая() Тогда
	//	ТекстОшибки = Нстр("ru = 'Запрещено добавление элементов справочника!'; en = 'It is forbidden to add directory entries!'");		
	//	Сообщить(ТекстОшибки);
	//	Отказ = Истина;
	//КонецЕсли;
	//rarus bonmak 08.10.2019 14177 --
	УправлениеДиалогомНаСервере();
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры //rarus bonmak 08.10.2019 14177 --


&НаСервере
Процедура ОбновитьЭлементНаСервере() //rarus bonmak 08.10.2019 14177 ++
	Если ЗначениеЗаполнено(Объект.IDExternalSystem) Тогда
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода("GetListOfOptions", Ложь);
		СтруктураПараметров.GUID = Объект.IDExternalSystem;
		// rarus agar 16.02.2022 18594 ++
		СтруктураПараметров.ВидПродукта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидПродукта, "IDExternalSystem");
		// rarus agar 16.02.2022 18594 --
		Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetListOfOptions(СтруктураПараметров);
		ЭтаФорма.Прочитать();
		УправлениеДиалогомНаСервере();
	КонецЕсли;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаКлиенте
Процедура ОбновитьЭлемент(Команда) //rarus bonmak 08.10.2019 14177 ++
	ОбновитьЭлементНаСервере();
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура УправлениеДиалогомНаСервере() //rarus bonmak 08.10.2019 14177 ++	
	Элементы.ФормаОбновитьЭлемент.Доступность = (ЗначениеЗаполнено(Объект.IDExternalSystem));
	
	Если ЗначениеЗаполнено(Объект.ДатаОбновления) Тогда
		Элементы.ФормаОбновитьЭлемент.Заголовок = Объект.ДатаОбновления;
	КонецЕсли;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) //rarus bonmak 08.10.2019 14177 ++
	Если Объект.Родитель = Справочники.Scan_ОпцииПродуктов.БазовыеОпции ИЛИ Объект.ТипОпции = Справочники.Scan_ТипыОпций.БазовыеОпции Тогда
		ТекстОшибки = Нстр("ru = 'Запрещено добавление базовых опций'; en = 'It is forbidden to add basic options'");		
		Сообщить(ТекстОшибки);
		Отказ = Истина;	
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 +++
	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 --- 
  
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаКлиенте
Процедура ТипОпцииПриИзменении(Элемент) //rarus BProg_Gladkov 11.12.2019 0014560 +-
	Объект.Родитель = СемействоОпцииПоТипуОпции(Объект.ТипОпции);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СемействоОпцииПоТипуОпции(ТипОпции) //rarus BProg_Gladkov 11.12.2019 0014560 +-
	Возврат Справочники.Scan_ОпцииПродуктов.СемействоОпцииПоТипуОпции(ТипОпции);
КонецФункции
